import React from 'react'
import BackgroundImage from 'gatsby-background-image'
import { graphql, StaticQuery } from 'gatsby'

import { classNames } from '../utils/classNames'
import styles from './components/whyUs/whyUs.module.scss'

const WhyUs = () => (
  <StaticQuery
    query={graphql`
      query {
        desktop: file(relativePath: { eq: "components/whyUs/assets/whyUsHeader.png" }) {
          childImageSharp {
            fluid(quality: 90, maxWidth: 1920) {
              ...GatsbyImageSharpFluid_withWebp
            }
          }
        }
      }
    `}
    render={(data) => {
      const imageData = data.desktop.childImageSharp.fluid
      const list = classNames(styles.content, styles.list)
      return (
        <>
          <BackgroundImage fluid={imageData} className={styles.header}>
            <div className={styles.headlineText}>
              <h2 data-aos="fade-up" data-aos-duration="1000" data-aos-delay="1000">
                שיטת הרוקחות האסתטית
              </h2>
              <h3 data-aos="fade-up" data-aos-duration="1000" data-aos-delay="2000">
                טיפולים לא קונבנציונאליים בהתאמה אישית.
              </h3>
            </div>
          </BackgroundImage>
          <main>
            <section>
              <div className={styles.content}>
                <h3>
                  מעירים את העור לחיים באמצעות שילובים טיפוליים לא קונבנציונאליים המותאמים לעורך – וגורמים לו להיראות
                  מוצק, צעיר ובריא יותר.
                </h3>
                <p>
                  את נותנת מעצמך לכו-לם: לילדים, לבן הזוג, לעבודה, לחברים, ומה בסך הכל ביקשת לעצמך? להזיז טיפה (רק טיפה)
                  את מחוגי השעון לאחור?
                  <br />
                  <br />
                  אחרי הכל, הזמן עושה את שלו. כאשר את נעמדת מול המראה, פתאום הקמטים קופצים לעיניים, הצלקות יותר בולטות,
                  העור נראה פחות חיוני וה"ג'ינג'ים" שפעם היו חמודים? מתחילים להפוך לכתמים חומים. רק מהעצב הפנים נראות
                  נפולות...
                  <br />
                  <br />
                  אז נכון, עדיין לא המציאו מכונת זמן שתחזיר אותנו 20 שנה אחורנית, אבל בינינו? בעזרת השילובים הנכונים של
                  ידע וטכנולוגיות מתקדמות, ניתן להחזיר את השמחה והאור לפנייך. כדי לעשות את זה, אי אפשר להתפשר על טיפולי
                  מדף אסתטיים או על אינספור תכשירים שלא באמת מותאמים לעור שלך, ועלולים לגרום לאכזבה או אפילו לרגישויות
                  ותופעות לוואי. כאן נכנסת לתמונה השיטה שפיתחנו.
                </p>
              </div>
              <div className={styles.content}>
                <h3>מעירים את העור לחיים בשיטת הרוקחות האסתטית</h3>
                <p>
                  התהליכים המתרחשים בעומק העור שונים מאדם לאדם, ולכן טיפול שעובד עבור אדם אחד לא יעבוד באותה יעילות עבור
                  אדם אחר. מתוך הבנה זו יצרנו את <b>שיטת הרוקחות האסתטית</b>: רקיחת טיפול מותאם אישית באמצעות שילובים לא
                  קונבנציונאליים של טכנולוגיות, תכשירים ופרוטוקולי טיפול. שילובים שמובילים לעור בריא ולא פחות חשוב:
                  לפנים שמחות ולהרגשה קלילה.
                  <br />
                  <br />
                  הצלחת הטיפול נובעת מצד אחד מהכרת המאפיינים שלך – כגון הגנטיקה, התנהגות העור, הגיל, המצב הנפשי ועוד,
                  ומצד שני מהיכולת לרקוח טיפולים לא קונבנציונאליים שמותאמים לך – ורק לך
                </p>
              </div>
              <div className={list}>
                <h3>שיטת הרוקחות האסתטית מבוססת על:</h3>
                <ol>
                  <li>
                    <b>הטכנולוגיות המתקדמות ביותר</b> – הפועלות בעומק העור.{' '}
                  </li>
                  <li>
                    <b>הטכנולוגיות המתקדמות ביותר</b> – ע"י אורנה ובר, מומחית בעלת ניסיון של למעלה משלושה עשורים בעולם
                    האסתטיקה: ניסיון שכולל פיתוח מוצרים קוסמטיים ופרוטוקולי טיפול, הכשרת קוסמטיקאיות וכמובן טיפולים
                    אסתטיים.{' '}
                  </li>
                  <li>
                    <b>שילובים יצירתיים של טכנולוגיות, תכשירים וטיפולים הנרקחים בהתאמה מלאה לעורך</b> ע"י אורנה ובר,
                    מומחית בעלת ניסיון של למעלה משלושה עשורים בעולם האסתטיקה: ניסיון שכולל פיתוח מוצרים קוסמטיים
                    ופרוטוקולי טיפול, הכשרת קוסמטיקאיות וכמובן טיפולים אסתטיים. העור.{' '}
                  </li>
                </ol>
              </div>
              <div className={styles.content}>
                <h3>עור בריא הוא עור יפה!</h3>
                <p>
                  כדי ליהנות מעור זוהר וחיוני, חשוב להבין שהוא ממלא תפקידים הרבה יותר נרחבים מ"רק" להיות יפה. למעשה, בכל
                  רגע נתון מתקיימים בעור אינספור תהליכים מורכבים, שצריך להכיר לעומק כדי לדאוג לבריאותו. וכאשר העור בריא,
                  הוא נראה במיטבו. לכן אנחנו בקליניקה לא מתמקדים באסתטיקה של העור, אלא <b>בבריאות העור</b> ובהחזרתו
                  לתפקוד תקין. <b>התוצאה</b> היא אסתטית ומחזיקה לאורך זמן.
                </p>
              </div>
              <div className={styles.content}>
                <h3>במה אנחנו מטפלים?</h3>
                <p>
                  בבעיות שמצריכות טיפול עמוק בעור, כגון טיפול בקמטים, אקנה, צלקות וחטטים, פיגמנטציה, מיצוק של העור,
                  טיפול בנקבוביות פעורות ועוד.
                </p>
              </div>
              <div className={styles.content}>
                <h3>במה אנחנו מטפלים?</h3>
                <p>
                  <span>הטיפול בשיטת הרוקחות האסתטית מבוסס על 3 שלבים מרכזיים:</span>
                  <br />
                  <br />
                  <b>אבחון עומק</b> - יש אנשים שיודעים לקרוא בכף היד, אנחנו מומחים בלקרוא את העור שלך 😊. אחרי הכל,
                  אבחנה מדויקת היא המפתח לבניית תכנית טיפול אפקטיבית. שלב זה מבוסס על אבחון ממוחשב המספק תמונת מצב
                  מדויקת של העור, על שאלון מקיף ועל הבנה עמוקה של תהליכים בעור.
                  <br />
                  <b>בניית תכנית טיפול</b> - רקיחת תכנית טיפול המבוססת על שילובים בלתי קונבנציונאליים של תכשירים,
                  טכנולוגיות וטיפולים. התכנית נבנית בהתאמה מלאה לעורך – ומובילה לעור בריא וחיוני לאורך זמן.
                  <br />
                  <b>מעקב אקטיבי</b> - מעקב אחר התנהגות העור טיפול אחרי טיפול, לצורך ביצוע אופטימיזציה ומקסום האפקט
                  הטיפולי. אנחנו נוביל אותך למקום הרצוי יד ביד. המעטפת הטיפולית מתייחסת גם לגורמים תזונתיים, גופניים
                  ונפשיים שמשפיעים על מצב העור, ויאפשרו לך להרגיש במיטבך בכל המובנים.
                </p>
              </div>
              <div className={list}>
                <h3>שיטת הרוקחות האסתטית מבוססת על:</h3>
                <ul>
                  <li>
                    <b>בריאות לפני הכל</b> – פועלים לחיזוק, עיבוי וחיסון העור באופן שמקטין רגישויות, זיהומים ומחלות עור.{' '}
                  </li>
                  <li>
                    <b>הטכנולוגיות המתקדמות ביותר</b> – כשהעור בריא, הוא זוהר וחיוני לאורך זמן.
                  </li>
                  <li>
                    <b>תוצאות יוצאות דופן</b> בעזרת שילובים לא קונבנציונאליים המותאמים לעורך
                  </li>
                  <li>
                    <b>קיצור זמני הטיפול בעשרות אחוזים</b> לעיתים מתחילים לראות תוצאות כבר אחרי הטיפול הראשון!
                  </li>
                  <li>
                    <b>תוצאות יוצאות דופן</b> רקיחת טיפול המותאם ב- 100% לעורך ולמצבך, מפחית למינימום את הסיכוי להופעת
                    רגישויות ותופעות לוואי.
                  </li>
                </ul>
              </div>
            </section>
          </main>
        </>
      )
    }}
  />
)

// const WhyUs = ({ pageContext }) => {
//   //   return <div>test</div>
//   return (
//     <div>test</div>
//     // <StaticQuery
//     //   query={graphql`
//     //     query {
//     //       gcms {
//     //         whyuses {
//     //           content {
//     //             html
//     //             markdown
//     //             raw
//     //             text
//     //           }
//     //           title
//     //         }
//     //       }
//     //     }
//     //   `}
//     //   render={(data) => (
//     //     <>
//     //       {console.log(data, pageContext, 'data')}
//     //       {/* <div dangerouslySetInnerHTML={{ __html: data.gcms.whyuses[0].content.text }} /> */}
//     //       <div>t</div>
//     //     </>
//     //   )}
//     // />
//   )
// }

export default WhyUs
